import React from 'react'

import { Helmet } from 'react-helmet'

import NavigationLinks from '../components/navigation-links'
import './home.css'

const Home = (props) => {
  return (
    <div className="home-container">
      <Helmet>
        <title>موقع جرف سلمان</title>
        <meta property="og:title" content="موقع جرف سلمان" />
      </Helmet>
      <div className="home-container1">
        <header data-role="Accordion" className="home-header">
          <img
            alt="logo"
            src="https://presentation-website-assets.teleporthq.io/logos/logo.png"
            className="home-image"
          />
          <div className="home-separator"></div>
          <nav className="home-nav">
            <NavigationLinks rootClassName="rootClassName19"></NavigationLinks>
          </nav>
          <div data-role="AccordionHeader" className="home-accordion-header">
            <svg viewBox="0 0 1024 1024" className="home-icon">
              <path d="M128 554.667h768c23.552 0 42.667-19.115 42.667-42.667s-19.115-42.667-42.667-42.667h-768c-23.552 0-42.667 19.115-42.667 42.667s19.115 42.667 42.667 42.667zM128 298.667h768c23.552 0 42.667-19.115 42.667-42.667s-19.115-42.667-42.667-42.667h-768c-23.552 0-42.667 19.115-42.667 42.667s19.115 42.667 42.667 42.667zM128 810.667h768c23.552 0 42.667-19.115 42.667-42.667s-19.115-42.667-42.667-42.667h-768c-23.552 0-42.667 19.115-42.667 42.667s19.115 42.667 42.667 42.667z"></path>
            </svg>
          </div>
          <div data-role="AccordionContent" className="home-accordion-content">
            <div className="home-nav1">
              <NavigationLinks rootClassName="rootClassName20"></NavigationLinks>
            </div>
          </div>
        </header>
      </div>
      <div className="home-sidebar">
        <div className="home-testimonial">
          <img
            alt="image"
            src="https://cdn-arabic.khamenei.ir/assets/files/styles/org/public/repo/pics/2016/08/18/pic-18769-1471524170.jpg"
            className="home-image1"
          />
          <span className="home-text">
            <br></br>
            <span>السيد علي الخامنئي</span>
          </span>
          <div className="home-testimonial1">
            <div className="home-container2">
              <svg viewBox="0 0 950.8571428571428 1024" className="home-icon02">
                <path d="M438.857 548.571v219.429c0 60.571-49.143 109.714-109.714 109.714h-219.429c-60.571 0-109.714-49.143-109.714-109.714v-402.286c0-161.143 131.429-292.571 292.571-292.571h36.571c20 0 36.571 16.571 36.571 36.571v73.143c0 20-16.571 36.571-36.571 36.571h-36.571c-80.571 0-146.286 65.714-146.286 146.286v18.286c0 30.286 24.571 54.857 54.857 54.857h128c60.571 0 109.714 49.143 109.714 109.714zM950.857 548.571v219.429c0 60.571-49.143 109.714-109.714 109.714h-219.429c-60.571 0-109.714-49.143-109.714-109.714v-402.286c0-161.143 131.429-292.571 292.571-292.571h36.571c20 0 36.571 16.571 36.571 36.571v73.143c0 20-16.571 36.571-36.571 36.571h-36.571c-80.571 0-146.286 65.714-146.286 146.286v18.286c0 30.286 24.571 54.857 54.857 54.857h128c60.571 0 109.714 49.143 109.714 109.714z"></path>
              </svg>
            </div>
            <span className="home-text03">
              * إن اسم الحسين بن علي(ع) بمثابة بيرق للعدالة والفضائل المعنويّة
              رغم مرور أربعة عشر قرناً.
            </span>
            <div className="home-container3">
              <svg viewBox="0 0 950.8571428571428 1024" className="home-icon04">
                <path d="M438.857 182.857v402.286c0 161.143-131.429 292.571-292.571 292.571h-36.571c-20 0-36.571-16.571-36.571-36.571v-73.143c0-20 16.571-36.571 36.571-36.571h36.571c80.571 0 146.286-65.714 146.286-146.286v-18.286c0-30.286-24.571-54.857-54.857-54.857h-128c-60.571 0-109.714-49.143-109.714-109.714v-219.429c0-60.571 49.143-109.714 109.714-109.714h219.429c60.571 0 109.714 49.143 109.714 109.714zM950.857 182.857v402.286c0 161.143-131.429 292.571-292.571 292.571h-36.571c-20 0-36.571-16.571-36.571-36.571v-73.143c0-20 16.571-36.571 36.571-36.571h36.571c80.571 0 146.286-65.714 146.286-146.286v-18.286c0-30.286-24.571-54.857-54.857-54.857h-128c-60.571 0-109.714-49.143-109.714-109.714v-219.429c0-60.571 49.143-109.714 109.714-109.714h219.429c60.571 0 109.714 49.143 109.714 109.714z"></path>
              </svg>
            </div>
          </div>
          <span className="home-text04">المزيد</span>
        </div>
        <div className="home-testimonial2">
          <img
            alt="image"
            src="https://www.almashhad-alyemeni.com/img/22/08/23/246313.jpg"
            className="home-image2"
          />
          <span className="home-text05">
            <br></br>
            <span>السيد عبد الملك بدر الدين الحوثي</span>
          </span>
          <div className="home-testimonial3">
            <div className="home-container4">
              <svg viewBox="0 0 950.8571428571428 1024" className="home-icon06">
                <path d="M438.857 548.571v219.429c0 60.571-49.143 109.714-109.714 109.714h-219.429c-60.571 0-109.714-49.143-109.714-109.714v-402.286c0-161.143 131.429-292.571 292.571-292.571h36.571c20 0 36.571 16.571 36.571 36.571v73.143c0 20-16.571 36.571-36.571 36.571h-36.571c-80.571 0-146.286 65.714-146.286 146.286v18.286c0 30.286 24.571 54.857 54.857 54.857h128c60.571 0 109.714 49.143 109.714 109.714zM950.857 548.571v219.429c0 60.571-49.143 109.714-109.714 109.714h-219.429c-60.571 0-109.714-49.143-109.714-109.714v-402.286c0-161.143 131.429-292.571 292.571-292.571h36.571c20 0 36.571 16.571 36.571 36.571v73.143c0 20-16.571 36.571-36.571 36.571h-36.571c-80.571 0-146.286 65.714-146.286 146.286v18.286c0 30.286 24.571 54.857 54.857 54.857h128c60.571 0 109.714 49.143 109.714 109.714z"></path>
              </svg>
            </div>
            <span className="home-text08">
              كان للحادثة والواقعة علاقة بالرسول &quot;صلوات الله عليه وعلى
              آله&quot;، هي حربٌ تستهدفه، تستهدف الانتقام منه، وأيضاً بما
              يمثِّله الإمام الحسين &quot;عليه السلام&quot; في امتداده بحمل
              الدين الإسلامي.
            </span>
            <div className="home-container5">
              <svg viewBox="0 0 950.8571428571428 1024" className="home-icon08">
                <path d="M438.857 182.857v402.286c0 161.143-131.429 292.571-292.571 292.571h-36.571c-20 0-36.571-16.571-36.571-36.571v-73.143c0-20 16.571-36.571 36.571-36.571h36.571c80.571 0 146.286-65.714 146.286-146.286v-18.286c0-30.286-24.571-54.857-54.857-54.857h-128c-60.571 0-109.714-49.143-109.714-109.714v-219.429c0-60.571 49.143-109.714 109.714-109.714h219.429c60.571 0 109.714 49.143 109.714 109.714zM950.857 182.857v402.286c0 161.143-131.429 292.571-292.571 292.571h-36.571c-20 0-36.571-16.571-36.571-36.571v-73.143c0-20 16.571-36.571 36.571-36.571h36.571c80.571 0 146.286-65.714 146.286-146.286v-18.286c0-30.286-24.571-54.857-54.857-54.857h-128c-60.571 0-109.714-49.143-109.714-109.714v-219.429c0-60.571 49.143-109.714 109.714-109.714h219.429c60.571 0 109.714 49.143 109.714 109.714z"></path>
              </svg>
            </div>
          </div>
          <span className="home-text09">المزيد</span>
        </div>
        <div className="home-testimonial4">
          <img
            alt="image"
            src="https://althawrah.ye/wp-content/uploads/2021/07/%D8%A7%D9%84%D8%AF%D9%8A%D9%862.jpg"
            className="home-image3"
          />
          <span className="home-text10">
            <br></br>
            <span>السيد حسين بدر الدين الحوثي</span>
          </span>
          <div className="home-testimonial5">
            <div className="home-container6">
              <svg viewBox="0 0 950.8571428571428 1024" className="home-icon10">
                <path d="M438.857 548.571v219.429c0 60.571-49.143 109.714-109.714 109.714h-219.429c-60.571 0-109.714-49.143-109.714-109.714v-402.286c0-161.143 131.429-292.571 292.571-292.571h36.571c20 0 36.571 16.571 36.571 36.571v73.143c0 20-16.571 36.571-36.571 36.571h-36.571c-80.571 0-146.286 65.714-146.286 146.286v18.286c0 30.286 24.571 54.857 54.857 54.857h128c60.571 0 109.714 49.143 109.714 109.714zM950.857 548.571v219.429c0 60.571-49.143 109.714-109.714 109.714h-219.429c-60.571 0-109.714-49.143-109.714-109.714v-402.286c0-161.143 131.429-292.571 292.571-292.571h36.571c20 0 36.571 16.571 36.571 36.571v73.143c0 20-16.571 36.571-36.571 36.571h-36.571c-80.571 0-146.286 65.714-146.286 146.286v18.286c0 30.286 24.571 54.857 54.857 54.857h128c60.571 0 109.714 49.143 109.714 109.714z"></path>
              </svg>
            </div>
            <span className="home-text13">
              منهج &quot;السيد حسين&quot;من مشكاة منهج رسول الله (صلى الله عليه
              وآله)، هو منهج الجهاد والاستشهاد فلم يأت الشهيد القائد
              &quot;الحسين بن بدر الدين الحوثي&quot; بجديد بل أحيا ثقافة القرآن
              التي أتى بها رسول الله صلوات الله عليه وآله ليخرج الناس من ظلمات
              الجهالة الى نور القرآن وعز الرسالة.
            </span>
            <div className="home-container7">
              <svg viewBox="0 0 950.8571428571428 1024" className="home-icon12">
                <path d="M438.857 182.857v402.286c0 161.143-131.429 292.571-292.571 292.571h-36.571c-20 0-36.571-16.571-36.571-36.571v-73.143c0-20 16.571-36.571 36.571-36.571h36.571c80.571 0 146.286-65.714 146.286-146.286v-18.286c0-30.286-24.571-54.857-54.857-54.857h-128c-60.571 0-109.714-49.143-109.714-109.714v-219.429c0-60.571 49.143-109.714 109.714-109.714h219.429c60.571 0 109.714 49.143 109.714 109.714zM950.857 182.857v402.286c0 161.143-131.429 292.571-292.571 292.571h-36.571c-20 0-36.571-16.571-36.571-36.571v-73.143c0-20 16.571-36.571 36.571-36.571h36.571c80.571 0 146.286-65.714 146.286-146.286v-18.286c0-30.286-24.571-54.857-54.857-54.857h-128c-60.571 0-109.714-49.143-109.714-109.714v-219.429c0-60.571 49.143-109.714 109.714-109.714h219.429c60.571 0 109.714 49.143 109.714 109.714z"></path>
              </svg>
            </div>
          </div>
          <span className="home-text14">المزيد</span>
        </div>
      </div>
    </div>
  )
}

export default Home
